app/controllers/book_comments_controller.rb

DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 2]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy

    BookComment.find_by(id: params[:id]).destroy