app/controllers/favorites_controller.rb

  def create
    book = Book.find(params[:book_id])
    favorite = current_user.favorites.new(book_id:book.id)
    favorite.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "created_at", "updated_at", "book_id") VALUES (?, ?, ?, ?)  [["user_id", 10], ["created_at", "2021-10-30 09:48:11.166371"], ["updated_at", "2021-10-30 09:48:11.166371"], ["book_id", 1]]