app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @book = Book.new
    @books = Book.where(user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 4]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "e6405994a331004739308bd4aba243d0fc7185497ec675d2d993680b55b0"], ["introduction", ""], ["updated_at", "2021-11-02 01:33:47.034046"], ["id", 10]]

  def index
    @user = current_user
    @users = User.all
---
SELECT "users".* FROM "users"