app/models/user.rb

    def follow(user_id)
      relationships.create(followed_id: user_id)
---
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 10], ["followed_id", 10], ["created_at", "2021-11-01 09:31:17.984722"], ["updated_at", "2021-11-01 09:31:17.984722"]]

    def unfollow(user_id)
      relationships.find_by(followed_id: user_id).destroy
---
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]